Revit 2015 API
StructuralSection Members
The StructuralSection type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the StructuralSection
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StructuralSectionShape
 The type of structural section shape.
StructuralSectionShapeName
 A human readable string representing the structural section shape.
See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace